<template>
  <div>
    <van-sticky>
    <div class="head-wrap d-flex">
      <img class="left-arrow" src="@commonImg/left-arrow.png" @click="navigateBack()" />
      <h1 class="head-name">用户协议</h1>
    </div>
  </van-sticky>
    <div class="content">
      <h2 class="content-name">APP用户服务协议</h2>
      <div class="content-time">
        <p>发布日期：2024年8月15日</p>
        <p>发布日期：2024年8月25日</p>
      </div>
      <p class="content-txt">
        为使用APP软件服务(以下简称“本服务”)，您应当 阅读并遵守《APP软件注册协议》(以下简称“本协 议”)以及专项规则等。请您务必审慎阅读、充分理 解各条款内容，特别是免除或限制责任的相应条款， 以以及开通或使用某项服务的单独协议，并选择接 受或不接受。限制、免责条款可能以加粗形式提示 您注意。除非您已阅读并接受本协议所有条款，否 则您无权使用APP软件服务。您对本服务的登录、 查看、绑定公众号、填写信息等行为即视为您已阅 读并同意本协议的约束。 如果您未满18周岁，请在 法定监护人的陪同下阅读本协议及其他上述协议。 一、协议的范围 1.1本协议是您与APP之间关于您使 用小程序软件服务所订立的协议。“小程序”是指 研发并提供小程序产品和服务的小程序迈医科技有 限公司及现在或未来设立的相关关联公司的单称或 合称。“用户”是指注册、登录、使用小程序软件 的个人或组织，在本协议中更多地称为“您”。 <br />
        1.2 本协议的内容包括以下条款及小程序已经发布的 或将来可能发布的各项规则，所有规则为本协议不 可分割的一部分，与协议正文具有同等法律效力。 本协议是您与小程序共同签订的，适用于您在小程 序的全部活动。在您注册成为用户时，您已经阅读、 理解并接受本协议的全部条款及各项规则，并承诺 遵守中国的各类法律、法规、政策的规定，如有违 反而导致任何法律后果的发生，您将以自己的名义 独立承担所有相应的法律责任。<br />
        1.3 小程序有权根据相关法律、法规、政策的要求 及提供服务的需要不时地修改本协议或根据本协议 制定、修改各类具体规则并在小程序相关系统版块 发布，请您适时注意本协议及具体规则的变更。若 您在本协议及具体规则内容公告变更后继续使用本 服务的，表示您已经阅读、理解并接受修改后的协 议和具体规则内容，也将遵循修改后的协议和具体规 则使用小程序的服务;同时就您在协议和具体规则修 订前通过小程序进行的交易及其效力，视为您已同 意并已按照本协议及有关规则进行了相后的培权和 浪认，共你不同音修改后的协心内突
      </p>
    </div>
  </div>
</template>

<script setup lang="ts">
import useRouterNavigation from '@config/utils'
const { navigateBack } = useRouterNavigation()
</script>

<style lang="less" scoped>
@import './index.less';
</style>
